import 'package:tafsir/how_to_use/domain/how_to.dart';

const howToList = <HowTo>[
  .new(
    'Где находится информация о суре',
    'В заголовке суры нажмите на иконку с буквой i.',
  ),
  .new(
    'Как перейти к определённому аяту',
    'В заголовке суры нажмите на иконку с вертикальной двустрелкой.',
  ),
  .new(
    'Как поделиться аятом',
    'В заголовке карточки аята нажмите на вертикальные три точки. В появившемся меню нажмите на стрелку вправо.',
  ),
  .new(
    'Как добавить/убрать закладку',
    'В заголовке карточки аята нажмите на вертикальные три точки. В появившемся меню нажмине на флажки.',
  ),
  .new(
    'Где находятся настройки темы',
    'В заголовке суры нажмите на иконку палитры.',
  ),
  .new(
    'Автоматическая смена темы',
    'Для автоматической смены светлой и темной темы в соответствии с настройками операционной системы откройте настройки темы, как описано выше, затем переведите переключатель "Как в системе" в положение Включено. При этом автоматическая смена происходит между светлой и темной синими темами и между светлой и темной коричневыми темами. Следует заметить, что при включенном переключателе "Как в системе" выбор между светлой и темной синими темами и между светлой и темной коричневыми темами не приводт к смену тем, т. к. этот параметр регулируется операционной системой: можно только выбрать пару – синюю или коричневую.',
  ),
  .new(
    'Как запретить отключение экрана',
    'Откройте настройки темы, как описано выше, затем переведите переключатель "Не выключать экран" в положение Включено.',
  ),
  .new(
    'Как сменить тему',
    'Откройте настройки темы, как описано выше, затем выберите нужную тему.',
  ),
  .new(
    'Где находятся общие настройки',
    'В заголовке суры нажмите на иконку шестерёнки.',
  ),
  .new(
    'Как скрыть отображение текста',
    'Откройте общие настройки, как описано выше, затем снимите соответствующую галочку в группе Отображать.',
  ),
  .new(
    'Как изменить размер шрифта',
    'Откройте общие настройки, как описано выше, затем потяните соответствующий ползунок в группе Размер шрифта.',
  ),
  .new(
    'Как изменить шрифт аятов',
    'Откройте общие настройки, как описано выше, затем, нажав на кнопку Арабский шрифт, выберите из списку нужный шрифт. Размер примеров арабского текста изменяется в соответствии с установленным значение ползунка Арабский текст в группе Размер шрифта.',
  ),
];
