import 'package:tafsir/how_to_use/domain/how_to.dart';

const howToList = [
  HowTo(
    'Где находится информация о суре',
    'В заголовке суры нажмите на иконку с буквой i.',
  ),
  HowTo(
    'Как перейти к определённому аяту',
    'В заголовке суры нажмите на иконку с вертикальной двустрелкой.',
  ),
  HowTo(
    'Как поделиться аятом',
    'В заголовке карточки аята нажмите на вертикальные три точки. В появившемся меню нажмите на стрелку вправо.',
  ),
  HowTo(
    'Как добавить/убрать закладку',
    'В заголовке карточки аята нажмите на вертикальные три точки. В появившемся меню нажмине на флажки.',
  ),
  HowTo(
    'Где находятся настройки темы',
    'В заголовке суры нажмите на иконку палитры.',
  ),
  HowTo(
    'Как запретить отключение экрана',
    'Откройте настройки темы, как описано выше, затем переведите переключатель "Не выключать экран" в положение Включено.',
  ),
  HowTo(
    'Как сменить тему',
    'Откройте настройки темы, как описано выше, затем выберите нужную тему.',
  ),
  HowTo(
    'Где находятся общие настройки',
    'В заголовке суры нажмите на иконку шестерёнки.',
  ),
  HowTo(
    'Как скрыть отображение текста',
    'Откройте общие настройки, как описано выше, затем снимите соответствующую галочку в группе Отображать.',
  ),
  HowTo(
    'Как изменить размер шрифта',
    'Откройте общие настройки, как описано выше, затем потяните соответствующий ползунок в группе Размер шрифта.',
  ),
  HowTo(
    'Как изменить шрифт аятов',
    'Откройте общие настройки, как описано выше, затем, нажав на кнопку Арабский шрифт, выберите из списку нужный шрифт. Размер примеров арабского текста изменяется в соответствии с установленным значение ползунка Арабский текст в группе Размер шрифта.',
  ),
];
